# Завдання 2a, 2b.
#
# Написати програму, що вираховує суму усіх цифр трьохзначного числа введеного користувачем через input(). Виконати програму в двох варіантах:
#
# a) З використанням рядків (тобто після input заборонено приводити введене число до int/float/Decimal безпосередньо). Підказка: щоб отримати один символ рядку, треба використати квадратні дужки та індекс цього символу, індекси починаються з нуля: 'abcde'[2] == 'c'.
# b) Без використання обробки рядків (після input() одразу приведіть текст до int() та не переводьте в рядок назад, а працюйте з цим числом)

#a)
# num = input("Введите целое(много можешь не вводить, запишет первые три): ")[:3]
# a = int(num[0])
# b = int(num[1])
# c = int(num[2])
# print(a+b+c)
#b)
num = input("Введите целое(много можешь не вводить, запишет первые три): ")[:3]
che=int(num)
def sum(no):
    return 0 if no == 0 else int(no % 10) + sum(int(no / 10))
print(sum(che))